Enums/ВариантыРасширенногоПервогоНалоговогоПериода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ВариантыРасширенногоПервогоНалоговогоПериода</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеПредусмотрен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрацияВДекабре</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрацияВПоследние10ДнейКвартала</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрацияВПоследнемКвартале</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВариантыРасширенногоПервогоНалоговогоПериода/Ext/ManagerModule.bsl
// Определяет дату начала налогового периода с учетом даты регистрации организации (требований п. 2 ст. 55 НК
// и аналогичных). Налоговый период может быть расширен или отсутствовать, если организация зарегистрирована
// в конце обычного периода (например, 30 декабря). Налоговый период может быть сокращен, если организация
// зарегистрирована не в конце обычного периода (например, 10 января).
//
// Параметры:
//  Организация                              - СправочникСсылка.Организации - организация, для которой определяется
//                                             дата начала налогового периода;
//  Период                                   - Дата - дата в периоде, начало которого определяется;
//  ВариантРасширенногоПервогоПериода        - ПеречислениеСсылка.ВариантыРасширенногоПервогоНалоговогоПериода -
//                                             проверяемый вариант требований закона;
//  СтандартнаяДлительностьНалоговогоПериода - ПеречислениеСсылка.Периодичность - длительность налогового периода;
//  СокращатьНалоговыйПериод                 - Булево - Ложь, если для совместимости важно, чтобы дата регистрации
//                                                      возвращалась только для расширенного периода (не сокращенного),
//                                                      при этом п. 2 ст. 55 будет выполнен в неполном объеме);
//                                                      Истина, если требуется выполнение п. 2 ст. 55 в части
//                                                      сокращения периода.
//
// Возвращаемое значение (варианты):
//  Дата         - дата начала налогового периода;
//  Неопределено - в этом периоде обязанностей налогоплательщика у организации нет.
// 
Функция НачалоНалоговогоПериода(Организация, Период, ВариантРасширенногоПервогоПериода,
	Знач СтандартнаяДлительностьНалоговогоПериода = Неопределено, СокращатьНалоговыйПериод = Истина) Экспорт
	
	Если Не ЗначениеЗаполнено(СтандартнаяДлительностьНалоговогоПериода) Тогда
		СтандартнаяДлительностьНалоговогоПериода
		= СтандартнаяДлительностьНалоговогоПериода(ВариантРасширенногоПервогоПериода);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтандартнаяДлительностьНалоговогоПериода) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НачалоПериода = РегламентированнаяОтчетность.НачалоПериода(СтандартнаяДлительностьНалоговогоПериода, Период);
	
	ДатаРегистрации = РегламентированнаяОтчетность.ДатаРегистрацииОрганизации(Организация);
	
	Если Не ЗначениеЗаполнено(ДатаРегистрации) Тогда
		Возврат НачалоПериода;
	КонецЕсли;
	
	Если Период < ДатаРегистрации Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПропущенныйПериод = ПропущенныйНалоговыйПериод(ВариантРасширенногоПервогоПериода, Организация, ДатаРегистрации);
	Если Не ЗначениеЗаполнено(ПропущенныйПериод) Тогда
		Если СокращатьНалоговыйПериод И НачалоПериода < ДатаРегистрации Тогда
			// Первый налоговый период начинается с даты регистрации организации.
			НачалоПериода = ДатаРегистрации;
		КонецЕсли;
	ИначеЕсли НачалоПериода = ПропущенныйПериод Тогда
		// Этот период организация пропускает.
		НачалоПериода = Неопределено;
	ИначеЕсли НачалоПериода = РегламентированнаяОтчетность.ДобавитьПериод(
		ПропущенныйПериод, СтандартнаяДлительностьНалоговогоПериода) Тогда
		// Первый налоговый период (следующий за пропущенным) - расширенный, он начинается с даты регистрации организации.
		НачалоПериода = ДатаРегистрации;
	КонецЕсли;
	
	Возврат НачалоПериода;
	
КонецФункции

// Определяет границы ближайшего налогового периода с учетом даты регистрации организации
// (требований п. 2 ст. 55 НК и аналогичных).
//
// Параметры:
//  Организация                              - СправочникСсылка.Организации - организация, для которой определяются
//                                             границы ближайшего налогового периода;
//  Период                                   - Дата - дата в периоде, границы которого определяются;
//  ВариантРасширенногоПервогоПериода        - ПеречислениеСсылка.ВариантыРасширенногоПервогоНалоговогоПериода -
//                                             проверяемый вариант требований закона;
//  СтандартнаяДлительностьНалоговогоПериода - ПеречислениеСсылка.Периодичность - длительность налогового периода.
//
// Возвращаемое значение:
//  Структура - границы периода
//    * Период - Дата - стандартное начало налогового периода (например, 01 июля для третьего квартала);
//    * Начало - Дата - фактическое начало налогового периода (может совпадать со стандартным началом или
//               датой регистрации организации;
//    * Конец  - Дата - дата с указанием времени.
// 
Функция БлижайшийНалоговыйПериод(Организация, Знач ПроверяемыйПериод, ВариантРасширенногоПервогоПериода,
	Знач СтандартнаяДлительностьНалоговогоПериода = Неопределено) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Период", '0001-01-01');
	Результат.Вставить("Начало", '0001-01-01');
	Результат.Вставить("Конец",  '0001-01-01');
	
	Если Не ЗначениеЗаполнено(СтандартнаяДлительностьНалоговогоПериода) Тогда
		СтандартнаяДлительностьНалоговогоПериода
		= СтандартнаяДлительностьНалоговогоПериода(ВариантРасширенногоПервогоПериода);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтандартнаяДлительностьНалоговогоПериода) Тогда
		СтандартнаяДлительностьНалоговогоПериода = Перечисления.Периодичность.Год;
	КонецЕсли;
	
	ДатаРегистрации = РегламентированнаяОтчетность.ДатаРегистрацииОрганизации(Организация);
	
	Если ПроверяемыйПериод < ДатаРегистрации Тогда
		ПроверяемыйПериод = ДатаРегистрации;
	КонецЕсли;
	
	НачалоПроверяемогоПериода = РегламентированнаяОтчетность.НачалоПериода(
	СтандартнаяДлительностьНалоговогоПериода, ПроверяемыйПериод);
	
	Если Не ЗначениеЗаполнено(ДатаРегистрации) Тогда
		
		Результат.Период = НачалоПроверяемогоПериода;
		Результат.Начало = НачалоПроверяемогоПериода;
		
	Иначе
		
		ПериодПослеРегистрации = РегламентированнаяОтчетность.ДобавитьПериод(
		ДатаРегистрации, СтандартнаяДлительностьНалоговогоПериода);
		
		ПериодПослеРегистрации = РегламентированнаяОтчетность.НачалоПериода(
		СтандартнаяДлительностьНалоговогоПериода, ПериодПослеРегистрации);
		
		Если ПериодПослеРегистрации < НачалоПроверяемогоПериода Тогда
			
			// Организация зарегистрирована давно, дата ее регистрации заведомо не имеет значения.
			Результат.Период = НачалоПроверяемогоПериода;
			Результат.Начало = НачалоПроверяемогоПериода;
			
		Иначе
			
			НачалоПериодаРегистрации = РегламентированнаяОтчетность.НачалоПериода(
			СтандартнаяДлительностьНалоговогоПериода, ДатаРегистрации);
			
			ПропущенныйПериод = ПропущенныйНалоговыйПериод(ВариантРасширенногоПервогоПериода, Организация, ДатаРегистрации);
			
			Если ЗначениеЗаполнено(ПропущенныйПериод) Тогда
				
				// Первый налоговый период - следующий за периодом регистрации организации, он расширенный.
				Результат.Период = ПериодПослеРегистрации;
				Результат.Начало = ДатаРегистрации;
				
			ИначеЕсли НачалоПроверяемогоПериода <= ДатаРегистрации Тогда
				
				// Это первый налоговый период, он начинается с даты регистрации организации.
				Результат.Период = НачалоПроверяемогоПериода;
				Результат.Начало = ДатаРегистрации;
				
			Иначе
				
				// Это не первый налоговый период (дата регистрации организации уже не имеет значения).
				Результат.Период = НачалоПроверяемогоПериода;
				Результат.Начало = НачалоПроверяемогоПериода;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Результат.Конец = РегламентированнаяОтчетность.КонецПериода(
	СтандартнаяДлительностьНалоговогоПериода, Результат.Период);
	
	Возврат Результат;
	
КонецФункции

// Определяет стандартную длительность налогового периода по переданному варианту периода регистрации организации.
//
// Параметры:
//  ВариантРасширенногоПервогоПериода - ПеречислениеСсылка.ВариантыРасширенногоПервогоНалоговогоПериода - вариант
//                                      требований закона.
//
// Возвращаемое значение:
//  ПеречислениеСсылка.Периодичность - длительность периода; пустая ссылка, если установить не удалось.
//
Функция СтандартнаяДлительностьНалоговогоПериода(Вариант) Экспорт
	
	Если Вариант = РегистрацияВДекабре Тогда
		Возврат Перечисления.Периодичность.Год;
	ИначеЕсли Вариант = РегистрацияВПоследние10ДнейКвартала Тогда
		Возврат Перечисления.Периодичность.Квартал;
	ИначеЕсли Вариант = РегистрацияВПоследнемКвартале Тогда
		Возврат Перечисления.Периодичность.Год;
	Иначе
		Возврат Перечисления.Периодичность.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

// Определяет налоговый период, относящийся к дате регистрации организации, пропускаемый для целей уплаты налогов
// (представления отчетов). Требования установлены п. 2 ст. 55 НК РФ и п. 3 ст. 15 закона "О бухгалтерском учете".
//
// Например, если организация зарегистрирована в конце года, то некоторую отчетность за этот год она не представляет
// (и некоторые налоги не платит), а показатели деятельности за период с даты регистрации до конца следующего года
// включает в отчетность за следующий год. Таким образом, первый налоговый период у организации может быть длинее,
// чем последующие (т.е., может быть "расширенным").
//
// Другими словами, если дата регистрации попадает в определенные периоды, то не требуется представлять отчетность
// и/или уплачивать налоги за эти периоды.
//
// Законом определены несколько вариантов периодов, в зависимости от даты регистрации организации.
//
// Параметры:
//  Вариант         - ПеречислениеСсылка.ВариантыРасширенногоПервогоНалоговогоПериода - вариант требований закона;
//  Организация     - СправочникСсылка.Организации - организация, для которой определяется пропущенный период;
//  ДатаРегистрации - Дата - дата регистрации организации; если не передана, определяется из свойств организации;
//
// Возвращаемое значение (варианты):
//  Дата         - дата начала пропущенного периода;
//  Неопределено - нет оснований для пропуска периода.
//
Функция ПропущенныйНалоговыйПериод(Вариант, Организация, Знач ДатаРегистрации = Неопределено) Экспорт
	
	Если ДатаРегистрации = Неопределено Тогда
		ДатаРегистрации = РегламентированнаяОтчетность.ДатаРегистрацииОрганизации(Организация);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаРегистрации) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// П. 3 ст. 15 Закона "О бухгалтерском учете" от 06.12.2011 N 402-ФЗ.
	//
	Если Вариант = РегистрацияВПоследнемКвартале Тогда
		Если Месяц(ДатаРегистрации) >= 10 Тогда
			Возврат РегламентированнаяОтчетность.НачалоПериода(Перечисления.Периодичность.Год, ДатаРегистрации);
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	// Остальные варианты - в соответствии с п. 2 ст. 55 НК РФ. Ранее эта статья распространялась только
	// на организации, затем законом от 18.07.2017 N 173-ФЗ она была распространена и на физических лиц.
	//
	Дата173ФЗ = '20170819'; // дата вступления в силу 173-ФЗ
	Если ДатаРегистрации < Дата173ФЗ И НЕ РегламентированнаяОтчетность.ЭтоПБОЮЛ(Организация) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Вариант = РегистрацияВДекабре Тогда
		Если Месяц(ДатаРегистрации) = 12 Тогда
			Возврат РегламентированнаяОтчетность.НачалоПериода(Перечисления.Периодичность.Год, ДатаРегистрации);
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Если Вариант = РегистрацияВПоследние10ДнейКвартала Тогда
		
		// Вариант введен законом 173-ФЗ.
		Если ДатаРегистрации < Дата173ФЗ Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		ДатаОкончанияКвартала = КонецКвартала(ДатаРегистрации);
		
		КоличествоРабочихДнейДоКонцаКвартала = РегламентированнаяОтчетность.КоличествоРабочихДнейПериода(ДатаРегистрации, ДатаОкончанияКвартала);
		
		Если КоличествоРабочихДнейДоКонцаКвартала <> Неопределено Тогда
			КоличествоДнейДоКонцаКвартала = КоличествоРабочихДнейДоКонцаКвартала;
		Иначе
			КоличествоКалендарныхДнейДоКонцаКвартала = (ДатаОкончанияКвартала - НачалоДня(ДатаРегистрации) + 1) / 86400;
			КоличествоДнейДоКонцаКвартала = КоличествоКалендарныхДнейДоКонцаКвартала;
		КонецЕсли;
		
		Если КоличествоДнейДоКонцаКвартала < 10 Тогда
			Возврат РегламентированнаяОтчетность.НачалоПериода(Перечисления.Периодичность.Квартал, ДатаРегистрации);
		Иначе
			Возврат Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции
